Repository: ahmedgaboelnaga/NextGen-Banking-API
Catalog: backend/app/locales/*/LC_MESSAGES/messages.po
Languages: ar, es, fr

source: Welcome to the Next-Gen Backend API!
ar: مرحباً بك في واجهة برمجة التطبيقات من الجيل القادم!
es: ¡Bienvenido a la API Backend de próxima generación!
fr: Bienvenue dans l'API Backend de nouvelle génération!

source: Account activated successfully.
ar: تم تفعيل الحساب بنجاح.
es: Cuenta activada exitosamente.
fr: Compte activé avec succès.

source: Activation link has expired.
ar: انتهت صلاحية رابط التفعيل.
es: El enlace de activación ha expirado.
fr: Le lien d'activation a expiré.

source: Please request a new activation email.
ar: يرجى طلب بريد تفعيل جديد.
es: Por favor solicite un nuevo correo de activación.
fr: Veuillez demander un nouvel e-mail d'activation.

source: Invalid activation link.
ar: رابط التفعيل غير صالح.
es: Enlace de activación inválido.
fr: Lien d'activation invalide.

source: Please confirm that the link is correct.
ar: يرجى التأكد من صحة الرابط.
es: Por favor confirme que el enlace es correcto.
fr: Veuillez confirmer que le lien est correct.

source: Account is already active.
ar: الحساب مفعّل بالفعل.
es: La cuenta ya está activa.
fr: Le compte est déjà actif.

source: Please log in with your credentials.
ar: يرجى تسجيل الدخول باستخدام بيانات اعتمادك.
es: Por favor inicie sesión con sus credenciales.
fr: Veuillez vous connecter avec vos identifiants.

source: Failed to activate user account.
ar: فشل تفعيل حساب المستخدم.
es: Error al activar la cuenta de usuario.
fr: Échec de l'activation du compte utilisateur.

source: Please try again later.
ar: يرجى المحاولة مرة أخرى لاحقاً.
es: Por favor intente de nuevo más tarde.
fr: Veuillez réessayer plus tard.

source: User not found.
ar: المستخدم غير موجود.
es: Usuario no encontrado.
fr: Utilisateur non trouvé.

source: Please check the email address and try again.
ar: يرجى التحقق من عنوان البريد الإلكتروني والمحاولة مرة أخرى.
es: Por favor verifique la dirección de correo electrónico e intente de nuevo.
fr: Veuillez vérifier l'adresse e-mail et réessayer.

source: Account is already activated.
ar: الحساب مفعّل بالفعل.
es: La cuenta ya está activada.
fr: Le compte est déjà activé.

source: Activation email resent successfully, please check your inbox for activation link.
ar: تم إعادة إرسال بريد التفعيل بنجاح، يرجى التحقق من صندوق الوارد للحصول على رابط التفعيل.
es: Correo de activación reenviado exitosamente, por favor revise su bandeja de entrada para el enlace de activación.
fr: E-mail d'activation renvoyé avec succès, veuillez vérifier votre boîte de réception pour le lien d'activation.

source: Failed to resend activation email.
ar: فشل إعادة إرسال بريد التفعيل.
es: Error al reenviar el correo de activación.
fr: Échec du renvoi de l'e-mail d'activation.

source: Google authorisation failed.
ar: فشل تفويض Google.
es: La autorización de Google falló.
fr: L'autorisation Google a échoué.

source: Please try again.
ar: يرجى المحاولة مرة أخرى.
es: Por favor intente de nuevo.
fr: Veuillez réessayer.

source: Google did not return an email address.
ar: لم يُرجع Google عنوان بريد إلكتروني.
es: Google no devolvió una dirección de correo electrónico.
fr: Google n'a pas renvoyé d'adresse e-mail.

source: Please make sure your Google account has a verified email.
ar: يرجى التأكد من أن حساب Google الخاص بك يحتوي على بريد إلكتروني موثّق.
es: Por favor asegúrese de que su cuenta de Google tenga un correo electrónico verificado.
fr: Veuillez vous assurer que votre compte Google possède un e-mail vérifié.

source: Failed to process Google login.
ar: فشل معالجة تسجيل الدخول عبر Google.
es: Error al procesar el inicio de sesión con Google.
fr: Échec du traitement de la connexion Google.

source: Login successful.
ar: تم تسجيل الدخول بنجاح.
es: Inicio de sesión exitoso.
fr: Connexion réussie.

source: Please check your credentials and try again.
ar: يرجى التحقق من بيانات اعتمادك والمحاولة مرة أخرى.
es: Por favor verifique sus credenciales e intente de nuevo.
fr: Veuillez vérifier vos identifiants et réessayer.

source: Account is not activated.
ar: الحساب غير مفعّل.
es: La cuenta no está activada.
fr: Le compte n'est pas activé.

source: Please activate your account before logging in.
ar: يرجى تفعيل حسابك قبل تسجيل الدخول.
es: Por favor active su cuenta antes de iniciar sesión.
fr: Veuillez activer votre compte avant de vous connecter.

source: Failed to process login OTP request.
ar: فشل معالجة طلب رمز OTP لتسجيل الدخول.
es: Error al procesar la solicitud de OTP de inicio de sesión.
fr: Échec du traitement de la demande d'OTP de connexion.

source: Failed to verify login OTP request.
ar: فشل التحقق من طلب رمز OTP لتسجيل الدخول.
es: Error al verificar la solicitud de OTP de inicio de sesión.
fr: Échec de la vérification de la demande d'OTP de connexion.

source: User is already registered.
ar: المستخدم مسجّل مسبقاً.
es: El usuario ya está registrado.
fr: L'utilisateur est déjà enregistré.

source: Please register with different credentials.
ar: يرجى التسجيل ببيانات مختلفة.
es: Por favor regístrese con credenciales diferentes.
fr: Veuillez vous inscrire avec des informations d'identification différentes.

source: ID number is already registered.
ar: رقم الهوية مسجّل مسبقاً.
es: El número de identificación ya está registrado.
fr: Le numéro d'identité est déjà enregistré.

source: Please check your inbox for the activation email or use the resend activation link.
ar: يرجى التحقق من صندوق الوارد للحصول على بريد التفعيل أو استخدام رابط إعادة الإرسال.
es: Por favor revise su bandeja de entrada para el correo de activación o use el enlace de reenvío de activación.
fr: Veuillez vérifier votre boîte de réception pour l'e-mail d'activation ou utilisez le lien de renvoi d'activation.

source: Internal server error.
ar: خطأ داخلي في الخادم.
es: Error interno del servidor.
fr: Erreur interne du serveur.

source: Associated user account not found.
ar: حساب المستخدم المرتبط غير موجود.
es: La cuenta de usuario asociada no fue encontrada.
fr: Le compte utilisateur associé est introuvable.

source: Please contact support.
ar: يرجى التواصل مع الدعم الفني.
es: Por favor contacte al soporte.
fr: Veuillez contacter le support.

source: Failed to generate a unique user ID. Please try again.
ar: فشل في إنشاء معرّف مستخدم فريد. يرجى المحاولة مرة أخرى.
es: Error al generar un ID de usuario único. Por favor intente de nuevo.
fr: Échec de la génération d'un identifiant utilisateur unique. Veuillez réessayer.

source: Account is not active
ar: الحساب غير نشط
es: La cuenta no está activa
fr: Le compte n'est pas actif

source: Please activate your account using the link sent to your email.
ar: يرجى تفعيل حسابك باستخدام الرابط المرسل إلى بريدك الإلكتروني.
es: Por favor active su cuenta usando el enlace enviado a su correo electrónico.
fr: Veuillez activer votre compte en utilisant le lien envoyé à votre adresse e-mail.

source: Account is locked
ar: الحساب مقفل
es: La cuenta está bloqueada
fr: Le compte est verrouillé

source: Please contact support to unlock your account.
ar: يرجى التواصل مع الدعم الفني لإلغاء قفل حسابك.
es: Por favor contacte al soporte para desbloquear su cuenta.
fr: Veuillez contacter le support pour déverrouiller votre compte.

source: Account is inactive
ar: الحساب غير فعال
es: La cuenta está inactiva
fr: Le compte est inactif

source: Please contact support to activate your account.
ar: يرجى التواصل مع الدعم الفني لتفعيل حسابك.
es: Por favor contacte al soporte para activar su cuenta.
fr: Veuillez contacter le support pour activer votre compte.

source: User not found
ar: المستخدم غير موجود
es: Usuario no encontrado
fr: Utilisateur non trouvé

source: Please check the activation link or contact support.
ar: يرجى التحقق من رابط التفعيل أو التواصل مع الدعم الفني.
es: Por favor verifique el enlace de activación o contacte al soporte.
fr: Veuillez vérifier le lien d'activation ou contacter le support.

source: User already activated
ar: المستخدم مفعّل بالفعل
es: Usuario ya activado
fr: Utilisateur déjà activé

source: You can log in with your credentials.
ar: يمكنك تسجيل الدخول باستخدام بيانات اعتمادك.
es: Puede iniciar sesión con sus credenciales.
fr: Vous pouvez vous connecter avec vos identifiants.

source: Activation token expired
ar: انتهت صلاحية رمز التفعيل
es: Token de activación expirado
fr: Jeton d'activation expiré

source: Invalid activation token
ar: رمز التفعيل غير صالح
es: Token de activación inválido
fr: Jeton d'activation invalide

source: Invalid credentials
ar: بيانات الاعتماد غير صحيحة
es: Credenciales inválidas
fr: Identifiants invalides

source: Invalid OTP
ar: رمز التحقق غير صحيح
es: OTP inválido
fr: OTP invalide

source: Please check your OTP and try again.
ar: يرجى التحقق من رمز OTP والمحاولة مرة أخرى.
es: Por favor verifique su OTP e intente de nuevo.
fr: Veuillez vérifier votre OTP et réessayer.

source: Expired OTP
ar: رمز التحقق منتهي الصلاحية
es: OTP expirado
fr: OTP expiré

source: Please request a new OTP and try again.
ar: يرجى طلب رمز OTP جديد والمحاولة مرة أخرى.
es: Por favor solicite un nuevo OTP e intente de nuevo.
fr: Veuillez demander un nouvel OTP et réessayer.

source: An unexpected error occurred while verifying OTP.
ar: حدث خطأ غير متوقع أثناء التحقق من رمز OTP.
es: Se produjo un error inesperado al verificar el OTP.
fr: Une erreur inattendue s'est produite lors de la vérification de l'OTP.

source: Your account is temporarily locked
ar: حسابك مقفل مؤقتاً
es: Su cuenta está temporalmente bloqueada
fr: Votre compte est temporairement verrouillé

source: Please try again after {remaining_minutes} minutes.
ar: يرجى المحاولة مرة أخرى بعد {remaining_minutes} دقيقة.
es: Por favor intente de nuevo después de {remaining_minutes} minutos.
fr: Veuillez réessayer après {remaining_minutes} minutes.

source: Account Security Alert
ar: تنبيه أمان الحساب
es: Alerta de seguridad de cuenta
fr: Alerte de sécurité du compte

source: Account Temporarily Locked
ar: الحساب مقفل مؤقتاً
es: Cuenta temporalmente bloqueada
fr: Compte temporairement verrouillé

source: Hello from %(site_name)s
ar: مرحباً من %(site_name)s
es: Hola desde %(site_name)s
fr: Bonjour depuis %(site_name)s

source: We detected multiple unsuccessful login attempts on your account. For your security, your account has been temporarily locked.
ar: لقد اكتشفنا محاولات تسجيل دخول فاشلة متعددة على حسابك. لحمايتك، تم قفل حسابك مؤقتاً.
es: Detectamos múltiples intentos de inicio de sesión fallidos en su cuenta. Por su seguridad, su cuenta ha sido temporalmente bloqueada.
fr: Nous avons détecté plusieurs tentatives de connexion infructueuses sur votre compte. Pour votre sécurité, votre compte a été temporairement verrouillé.

source: Your account will be automatically unlocked after %(lockout_duration)s.
ar: سيتم إلغاء قفل حسابك تلقائياً بعد %(lockout_duration)s.
es: Su cuenta será desbloqueada automáticamente después de %(lockout_duration)s.
fr: Votre compte sera automatiquement déverrouillé après %(lockout_duration)s.

source: If you did not attempt to log in, we recommend:
ar: إذا لم تحاول تسجيل الدخول، نوصي بما يلي:
es: Si no intentó iniciar sesión, le recomendamos:
fr: Si vous n'avez pas tenté de vous connecter, nous recommandons:

source: Change your password immediately once access is restored.
ar: قم بتغيير كلمة المرور فوراً بعد استعادة الوصول.
es: Cambie su contraseña inmediatamente una vez que se restablezca el acceso.
fr: Changez votre mot de passe immédiatement une fois l'accès rétabli.

source: Contact our support team if you believe your account has been compromised.
ar: تواصل مع فريق الدعم إذا كنت تعتقد أن حسابك قد تعرض للاختراق.
es: Contacte a nuestro equipo de soporte si cree que su cuenta ha sido comprometida.
fr: Contactez notre équipe de support si vous pensez que votre compte a été compromis.

source: Check your email history for any other suspicious activity.
ar: تحقق من سجل بريدك الإلكتروني للكشف عن أي نشاط مشبوه.
es: Revise el historial de su correo electrónico para detectar cualquier actividad sospechosa.
fr: Vérifiez l'historique de vos e-mails pour toute autre activité suspecte.

source: Time of lockout:
ar: وقت القفل:
es: Hora de bloqueo:
fr: Heure de verrouillage:

source: Account will unlock at:
ar: سيُفتح الحساب في:
es: La cuenta se desbloqueará a:
fr: Le compte sera déverrouillé à:

source: Your account will be automatically unlocked after %(lockout_duration)s
ar: سيتم إلغاء قفل حسابك تلقائياً بعد %(lockout_duration)s
es: Su cuenta será desbloqueada automáticamente después de %(lockout_duration)s
fr: Votre compte sera automatiquement déverrouillé après %(lockout_duration)s

source: If you didn't attempt to login to your account, we recommend:
ar: إذا لم تحاول تسجيل الدخول، نوصي بما يلي:
es: Si no intentó iniciar sesión, le recomendamos:
fr: Si vous n'avez pas tenté de vous connecter, nous recommandons:

source: Change your password immediately
ar: قم بتغيير كلمة المرور فوراً
es: Cambie su contraseña inmediatamente
fr: Changez votre mot de passe immédiatement

source: Contact our support team if you believe your account has been compromised
ar: تواصل مع فريق الدعم إذا كنت تعتقد أن حسابك قد تعرض للاختراق
es: Contacte a nuestro equipo de soporte si cree que su cuenta ha sido comprometida
fr: Contactez notre équipe de support si vous pensez que votre compte a été compromis

source: Check your email for any suspicious activity
ar: تحقق من بريدك الإلكتروني للكشف عن أي نشاط مشبوه
es: Revise su correo electrónico para detectar cualquier actividad sospechosa
fr: Vérifiez vos e-mails pour toute activité suspecte

source: Activate Your Account
ar: قم بتفعيل حسابك
es: Active su cuenta
fr: Activez votre compte

source: Welcome to %(site_name)s
ar: مرحباً بك في %(site_name)s!
es: ¡Bienvenido a %(site_name)s!
fr: Bienvenue sur %(site_name)s!

source: Thank you for registering. Please click the button below to activate your account:
ar: شكراً لتسجيلك. يرجى النقر على الزر أدناه لتفعيل حسابك:
es: Gracias por registrarse. Por favor haga clic en el botón de abajo para activar su cuenta:
fr: Merci de vous être inscrit. Veuillez cliquer sur le bouton ci-dessous pour activer votre compte:

source: Activate Account
ar: تفعيل الحساب
es: Activar cuenta
fr: Activer le compte

source: If the button doesn't work, copy and paste this link into your browser:
ar: إذا لم يعمل الزر، انسخ والصق هذا الرابط في المتصفح:
es: Si el botón no funciona, copie y pegue este enlace en su navegador:
fr: Si le bouton ne fonctionne pas, copiez et collez ce lien dans votre navigateur:

source: This activation link will expire in %(expiry_time)s minutes.
ar: سينتهي صلاحية رابط التفعيل خلال %(expiry_time)s دقيقة.
es: Este enlace de activación expirará en %(expiry_time)s minutos.
fr: Ce lien d'activation expirera dans %(expiry_time)s minutes.

source: Questions? Contact us at
ar: أى أسئلة؟ تواصل معنا على
es: ¿Preguntas? Contáctenos en
fr: Des questions ? Contactez-nous à

source: All rights reserved.
ar: جميع الحقوق محفوظة
es: Todos los derechos reservados.
fr: Tous droits réservés.

source: Your OTP Code
ar: رمز التحقق الخاص بك
es: Su código OTP
fr: Votre code OTP

source: Hello,
ar: مرحباً،
es: Hola,
fr: Bonjour,

source: Your One-Time Password (OTP) for login is:
ar: رمز التحقق (OTP) لتسجيل الدخول هو:
es: Su contraseña de un solo uso (OTP) para iniciar sesión es:
fr: Votre mot de passe à usage unique (OTP) pour vous connecter est:

source: This OTP is valid for %(expiry_time)s minutes. Please use it within this timeframe to complete your login process.
ar: رمز OTP هذا صالح لمدة %(expiry_time)s دقيقة. يرجى استخدامه خلال هذا الإطار الزمني لإكمال عملية تسجيل الدخول.
es: Este OTP es válido por %(expiry_time)s minutos. Por favor úselo dentro de este plazo para completar su proceso de inicio de sesión.
fr: Ce OTP est valide pendant %(expiry_time)s minutes. Veuillez l'utiliser dans ce délai pour terminer votre processus de connexion.

source: If you did not request this OTP, please ignore this email and contact our support team immediately.
ar: إذا لم تطلب هذا الرمز، يرجى تجاهل هذا البريد الإلكتروني والاتصال بفريق الدعم فوراً.
es: Si no solicitó este OTP, por favor ignore este correo y contacte a nuestro equipo de soporte inmediatamente.
fr: Si vous n'avez pas demandé ce OTP, veuillez ignorer cet email et contacter notre équipe de support immédiatement.
